snlkuharlocal/src/DataProcessors/ПроверкаОтправкиУПД/ПроверкаОтправкиУПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаОтправкиУПД</name>
  <attributes>
    <name>ДокОбъект</name>
  </attributes>
  <attributes>
    <name>ПутьБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУдалятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектовУПД/ЗначенияСвойствОбъектовУПД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектовУПД</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РезервированиеШКGS1/РезервированиеШКGS1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезервированиеШКGS1</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУстановки</name>
    <type>
      <types>DocumentRef.УстановкаШКGS1</types>
    </type>
  </attributes>
  <dimensions>
    <name>GS1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.РезервированиеШК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Присвоен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Адрес</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/СчетФактура/СчетФактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактура</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.Чек</basedOn>
  <basedOn>Document.ПродажаИМ</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСовсемБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Чек</types>
        <types>DocumentRef.ПродажаИМ</types>
        <types>String</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСовсемБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧека</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректируемыйСчетФактура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыПродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоКорректировки</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАванс</name>
      <type>
        <types>DocumentRef.СчетФактураНаАванс</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/УстановкаШКGS1/УстановкаШКGS1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаШКGS1</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШк</name>
    <comment>Вид устанавливаемого ШК</comment>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидШк</name>
      <comment>Вид устанавливаемого ШК</comment>
      <type>
        <types>EnumRef.ВидыШК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипШк</name>
      <comment>Тип устанавливаемого ШК</comment>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыШК</name>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ПроверкаОтправкиУПД/ObjectModule.bsl
Перем ПутиПапок Экспорт;
Перем ПутиФайлов Экспорт;
Перем ИмяПути Экспорт;
Перем Контрагент Экспорт;
Перем ТипШк Экспорт;
Перем КодМетро Экспорт; 
Перем Файлы Экспорт;
Перем Ошибки Экспорт;
Перем КритичОшибки,КритичОшибкиЛента Экспорт;
Перем ТЗПЕчать,ТЗШапка,АктШапка,АктТаблица Экспорт;
Перем Ашан Экспорт;
Перем НомПП;
Перем Отказ;
Перем ОшибкиАртикул;




Процедура СообщитьМенеджеру() Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
		
	//	Менеджер=СтрШапка.контрагент.Менеджер;
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	//Сообщение.Получатели.Добавить("nechaeva@collant.ru");
	Сообщение.Получатели.Добавить("ovlto@collant.ru");
	Сообщение.Получатели.Добавить("pro@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Просрочка отправки документов.";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	//Для рр=0 по файлы.Количество()-1 Цикл
	//	Строка=Строка+символы.ПС+Файлы[рр];
	//КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>1 Тогда
		Строка=Строка+Символы.ПС+"Не выписаны УПД:";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
		//сообщить(ОписаниеОшибки());
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		ЗаписатьВЛог("Проверка отправки УПД","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры


//нечаева 04,12,20+++
Процедура СообщитьМенеджеруОстаткиШК(КолОст=0) Экспорт
	
	Если ПараметрыСеанса.Отладка Тогда
		Возврат;
	КонецЕсли;
	
	Профиль= Новый ИнтернетПочтовыйПрофиль;
	// Кухарь А.Ю.  08.09.2022 начало
	//
	//Катаев+ 28/06/13 Добавка для филиалов
	//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
	//	Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//	Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//Иначе
	//	Профиль.АдресСервераPOP3   = "87.236.190.180";
	//	Профиль.АдресСервераSMTP   =  "87.236.190.180";
	//КонецЕсли;
	////Катаев- 28/06/13
	//Профиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);		 
	// Кухарь А.Ю.  08.09.2022 конец
	Профиль.ВремяОжидания      = 60; 
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//Профиль.Пользователь="*%*%*%";
	//Профиль.Пароль="*$*$*$";
	Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Логин;
	Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуЕкод).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	//---------------------------------------------------------------
	//Попытка
	//	ИмяФайлаПечати=ФормированиеПечати(ТЗПечать,ТЗШапка); //+++
	//Исключение
	//	КритичОшибки.Добавить("Не сформирован файл печати! "+Символ(13));
	//КонецПопытки;
	
	// и прикрепляем файл;
	
	
	
	////----------------------------------------------------------------
	Сообщение=новый интернетПочтовоеСообщение;
	Сообщение.Получатели.Добавить("nikiforova@collant.ru");
	Сообщение.Получатели.Добавить("emelyanova@collant.ru");
	Сообщение.Получатели.Добавить("chelnokova@collant.ru");
	Сообщение.Получатели.Добавить("elvira@collant.ru");
	
	Сообщение.Отправитель="ecode@collant.ru";
	
	Сообщение.Тема="Остатков ШК GS1 меньше 500!";
	Строка=Символ(13)+Символ(13)+"       Добрый день!"+Символ(13)+Символ(13);
	
	Для рр=0 по файлы.Количество()-1 Цикл
		Строка=Строка+символы.ПС+Файлы[рр];
	КонецЦикла;
	
	
	НомСтр=1;
	
	Строка=Строка+Символы.ПС;
	Если Ошибки.количество()>=1 Тогда
		Строка=Строка+Символы.ПС+"Заканчиваются остатки новых ШК GS1!!! Осталось - "+Строка(КолОст)+" Просьба завести дополнительные!!!";
	КонецЕсли;	
	Если НЕ Ошибки=Неопределено и ошибки.Количество()>0 Тогда
		Для рр=0 по ошибки.Количество()-1 Цикл
			Строка=Строка+Символы.ПС+НомСтр+". "+Ошибки[рр];
			Строка=Строка+Символы.ПС;
			НомСтр=НомСтр+1;
		КонецЦикла;
	конецЕсли;
	Строка=Строка+Символы.ПС+"________________________________________________________________";
	
	Сообщение.Тексты.Добавить(Строка);
	
	//Сообщение.Вложения.Добавить(ПутьФайла);
	
	Почта= Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(Профиль);
	исключение
		КритичОшибки.Добавить("Не возможно подключиться к почте, для отправке сообщений ! "+ОписаниеОшибки() );
	конецПопытки;
	Попытка
		Почта.Послать(Сообщение);
		//ЗаписатьВЛог("Отправка писем УПД Тандер","Письмо отправлено","Информация");   
	исключение
		
	конецПопытки;
	Почта.Отключиться();
	//УдалитьФайлы(ИмяФайлаПечати);     //+++
	
КонецПроцедуры
//нечаева 04,12,20 ---


Функция ВыбратьДокументыПР(СПК) Экспорт
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.Ссылка КАК Документ,
	|	СчетФактураВыданный.Всего КАК Сумма,
	|	СчетФактураВыданный.Контрагент.ДатаНачалаЭСФ КАК датаНачалаЭСФ,
	|	ЛОЖЬ КАК Пометка,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ, 1, 1) = """"
	|			ТОГДА СчетФактураНакладные.Накладная.ПунктДоставки.ПочтовыйАдрес
	|		ИНАЧЕ СчетФактураНакладные.Накладная.ПунктДоставки.ПечГрузополучательСФ
	|	КОНЕЦ КАК АдресДоставки,
	|	СчетФактураНакладные.Накладная.ПунктДоставки КАК СсылкаАдреса,
	|	СчетФактураНакладные.Накладная.ДатаПриемки КАК ДатаАвизации,
	|	СчетФактураНакладные.Накладная.Номер КАК НомерРНК
	|ИЗ
	|	Документ.СчетФактура.Накладные КАК СчетФактураНакладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактура КАК СчетФактураВыданный
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗначенияСвойствОбъектов.Объект.Номер КАК ОбъектНомер,
	|				ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	|				ЗначенияСвойствОбъектов.Значение КАК Значение,
	|				ЗначенияСвойствОбъектов.Объект КАК Объект
	|			ИЗ
	|				РегистрСведений.ЗначенияСвойствОбъектовУПД КАК ЗначенияСвойствОбъектов
	|			ГДЕ
	|				ЗначенияСвойствОбъектов.Свойство = &ТекСвойство) КАК ВложенныйЗапрос
	|			ПО СчетФактураВыданный.Ссылка = ВложенныйЗапрос.Объект
	|		ПО СчетФактураНакладные.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	СчетФактураНакладные.Накладная.Дата >= &ДатаНач
	|	И СчетФактураНакладные.Накладная.Дата <= &ДатаКон
	|	И СчетФактураВыданный.Проведен = ИСТИНА
	|	И ВложенныйЗапрос.Значение ЕСТЬ NULL
	|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураНакладные.Накладная.Проведен
	|	И СчетФактураВыданный.Контрагент.ОтправлятьУПД = ИСТИНА
	|	И СчетФактураВыданный.Контрагент.ДатаНачалаЭСФ <= СчетФактураНакладные.Накладная.Дата
	|	И СчетФактураВыданный.Контрагент В ИЕРАРХИИ(&ТекКонтрагенты)
	|	И (ВЫРАЗИТЬ(СчетФактураВыданный.Номер КАК СТРОКА(3))) = &прОфиса
	|	и ( ДОБАВИТЬКДАТЕ(СчетФактураНакладные.Накладная.ДатаПриемки, ДЕНЬ, 3)< &датапроверки ) 
	|	и ( ДОБАВИТЬКДАТЕ(СчетФактураНакладные.Накладная.ДатаОтгрузки, ДЕНЬ, 3)< &датапроверки )
	|   И  НЕ СчетФактураНакладные.Накладная.ПунктДоставки В ИЕРАРХИИ(&ТекспПД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Дата";
	
	
	// для дистрибьютеров на отдельной закладке надо сделать. 
	
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ТекКонтрагенты",СПК);
	ДатаНачалаЭСФ = Дата(2021,03,01);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаНачалаЭСФ));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(КонецГода(ТекущаяДата())));
	ТекспПД = Новый Массив;
	ТекспПД.Добавить(справочники.ПунктыДоставки.НайтиПоКоду("SNL-015875"));
	ТекспПД.Добавить(справочники.ПунктыДоставки.НайтиПоКоду("SNL-015743"));
	ТекспПД.Добавить(справочники.ПунктыДоставки.НайтиПоКоду("SNL-019991"));
	
	Запрос.УстановитьПараметр("ТекспПД",ТекспПД);
	Запрос.УстановитьПараметр("ТекСвойство",планыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("EDIНомер").Ссылка);
	Запрос.УстановитьПараметр("профиса","SSо");
	
	ДатаПроверки = ТекущаяДата(); 
	Запрос.УстановитьПараметр("ДатаПроверки",НачалоДня(ДатаПроверки));
	
	
	Запрос.Текст = ТекстЗапроса;
	//сообщить(ТекстЗапроса);
	ТаблицаФактур2 = Запрос.Выполнить().Выгрузить();
	
	возврат таблицафактур2;
	
КонецФункции



Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт
	
	//+++
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
       
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача проверка отправки УПД: Отправка писем. Автообмен разрешен для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	
	
	Ошибки.Очистить();
	
	
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		
		Запрос = Новый запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КодУзла <> """"
		|			ТОГДА ВложенныйЗапрос.КодУзла
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК кодУзла,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос2.КодУзла <> """"
		|			ТОГДА ВложенныйЗапрос2.КодУзла
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК кодУзла2,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос3.КодУзла <> """"
		|			ТОГДА ВложенныйЗапрос3.КодУзла
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК кодУзла3,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос4.КодУзла <> """"
		|			ТОГДА ВложенныйЗапрос4.КодУзла
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК кодУзла4
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыРегиональныеУзлы.КодУзла КАК КодУзла,
		|			1 КАК Поле1,
		|			КонтрагентыРегиональныеУзлы.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.РегиональныеУзлы КАК КонтрагентыРегиональныеУзлы) КАК ВложенныйЗапрос
		|		ПО Контрагенты.Родитель = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыРегиональныеУзлы.КодУзла КАК КодУзла,
		|			1 КАК Поле1,
		|			КонтрагентыРегиональныеУзлы.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.РегиональныеУзлы КАК КонтрагентыРегиональныеУзлы) КАК ВложенныйЗапрос2
		|		ПО Контрагенты.Родитель.Родитель = ВложенныйЗапрос2.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыРегиональныеУзлы.КодУзла КАК КодУзла,
		|			1 КАК Поле1,
		|			КонтрагентыРегиональныеУзлы.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.РегиональныеУзлы КАК КонтрагентыРегиональныеУзлы) КАК ВложенныйЗапрос3
		|		ПО Контрагенты.Родитель.Родитель.Родитель = ВложенныйЗапрос3.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыРегиональныеУзлы.КодУзла КАК КодУзла,
		|			1 КАК Поле1,
		|			КонтрагентыРегиональныеУзлы.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.РегиональныеУзлы КАК КонтрагентыРегиональныеУзлы) КАК ВложенныйЗапрос4
		|		ПО Контрагенты.Родитель.Родитель.Родитель.Родитель = ВложенныйЗапрос4.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыРегиональныеУзлы.КодУзла КАК КодУзла,
		|			1 КАК Поле1,
		|			КонтрагентыРегиональныеУзлы.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.РегиональныеУзлы КАК КонтрагентыРегиональныеУзлы) КАК ВложенныйЗапрос5
		|		ПО Контрагенты.Родитель.Родитель.Родитель.Родитель.Родитель = ВложенныйЗапрос5.Ссылка
		|ГДЕ
		|	Контрагенты.ДатаНачалаЭСФ <> &Пусто
		|	И Контрагенты.ОтправлятьУПД = ИСТИНА
		|	И НЕ Контрагенты.УПДДляДистрибьюторов = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
		Запрос.УстановитьПараметр("Пусто", Дата(1,1,1));
		Рез = Запрос.Выполнить().Выбрать();
		сзРодитель = Новый СписокЗначений;
		
		ТекУзел = ПараметрыСеанса.ЭтотУзел.код;
		
		
		Пока Рез.Следующий() Цикл
			
			
			// Кухарь А.Ю.  06.08.2024 начало
			// Если Рез.Ссылка.код = "SSR-9059" или Рез.Ссылка.код = "SSR-8987" или Рез.Ссылка.код = "SSP-4991" ТОгда
			Если Рез.Ссылка.код = "SSR-9059" или Рез.Ссылка.код = "SSR-8987" или Рез.Ссылка.код = "SSP-4991" или Рез.Ссылка.код = "SST-1208" ТОгда
				// Кухарь А.Ю.  06.08.2024 конец
				
				продолжить;
			КонецЕсли;
			
			сзРодитель.Добавить(Рез.Ссылка);
			
		КонецЦикла;
		
		ДатаПроверки = ТекущаяДата();
		//привязка к дате авизации +3 дня если не указана то дате отгрузки+ 3 дня
		//текущая дата-3 месяца будем смотреть. из тех что не подписаны.
		
		
		СПД =  ВыбратьДокументыПР(СзРодитель);
		//Ошибки.добавить("Просрочка отправки документов");
		Для каждого текстрока из СПД цикл
			
			Ошибки.Добавить(" "+текстрока.контрагент+" "+ТекСтрока.Номер+" ("+ТекСтрока.НомерРНК+") , "+ТекСтрока.Дата);
			
		Конеццикла;	
			
		
	КонецЕсли;		
	
	
	Если Ошибки.Количество()>0 Тогда
		
		СообщитьМенеджеру();
		
	КонецЕсли;	
	
	Ошибки.Очистить();

		
	// нечаева 17,02,20----
	//02,03,21++++
			
	Если ПланыОбмена.Основной.ЭтотУзел() = ПланыОбмена.Основной.НайтиПоКоду("SNL") Тогда
		//выбираем тольто те, по которым не отправлен упд и состояния выписан упд <> пустому.
		запрос = Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезервированиеШКGS1.GS1 КАК GS1
		|ИЗ
		|	РегистрСведений.РезервированиеШКGS1 КАК РезервированиеШКGS1
		|ГДЕ
		// нечаева 16,18,23++ 
		//|	РезервированиеШКGS1.ДокументУстановки = &пусто и
		// нечаева 16,08,23---
		|	РезервированиеШКGS1.Присвоен = ЛОЖЬ";
		
		запрос.УстановитьПараметр("пусто",документы.УстановкаШКGS1.ПустаяСсылка());	
		
		Рез = запрос.Выполнить().Выгрузить(); //ОбходРезультатаЗапроса.ПоГруппировкам;
		ТекКол = РЕз.Количество() ;
		Если ТекКол<=500 Тогда
			//отправляем письмо.
			Ошибки.Добавить("Не хватает ШК");
		КонецЕсли;
		
		
		Если Ошибки.Количество()>0 Тогда
			
			СообщитьМенеджеруОстаткиШК(ТекКол);
			
		КонецЕсли;
		
	конецЕсли;

	Ошибки.Очистить();

	
	
	
	//02,03,21---
	

	
	
КонецПроцедуры	


КодМетро	="SSP-8643";
КритичОшибки= Новый массив;

//нечаева 11,04,17+++
КритичОшибкиЛента = Новый массив; // для отправки многопаллетных документов
//нечаева 11,04,17---


Ошибки=Новый Массив;
Файлы=Новый Массив;

ПризнакЗаписиДокумента=Истина;

ТЗПечать=Новый ТаблицаЗначений;
ТЗПечать.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Найдена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ТипШк",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Название",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПокуп",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КодПрод",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("Колво",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("КолвоОтредактированное",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТЗПечать.Колонки.Добавить("Единица",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("КолУпак");
ТЗПечать.Колонки.Добавить("ВУпак");
ТЗПечать.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ВозврУпак",Новый ОписаниеТипов("Строка"));
ТЗПечать.Колонки.Добавить("ПромоЦена",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("ЦенаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("СуммаБезНДС",Новый ОписаниеТипов("Число"));
ТЗПечать.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));
ТЗПечать.Колонки.Добавить("ПризнакГруппыНом",Новый ОписаниеТипов("Число"));

//нечаева для метро  17,08,16 +++
ТЗПечать.Колонки.Добавить("ТипШКМетро",Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихКодов"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---




ТЗШапка=Новый ТаблицаЗначений;
ТЗШапка.Колонки.Добавить("НомЗаказа");
ТЗШапка.Колонки.Добавить("ДатаЗаказа");
ТЗШапка.Колонки.Добавить("ДатаДоставки");
//нечаева 27,11,17++ 
ТЗШапка.Колонки.Добавить("ВремяДоставки");
//нечаева 27,11,17--

ТЗШапка.Колонки.Добавить("ТипЗаказа");
ТЗШапка.Колонки.Добавить("КодВалюты");
ТЗШапка.Колонки.Добавить("ИЛНПокупателя");
ТЗШапка.Колонки.Добавить("НазваниеПокупателя");
ТЗШапка.Колонки.Добавить("ИЛНПлательщика");
ТЗШапка.Колонки.Добавить("НазваниеПлательщика");
ТЗШапка.Колонки.Добавить("ИЛНМестаДоставки");
ТЗШапка.Колонки.Добавить("НазваниеМестаДоставки");
ТЗШапка.Колонки.Добавить("АдресМестаДоставки");
ТЗШапка.Колонки.Добавить("ОбщСумма");
ТЗШапка.Колонки.Добавить("ОбщКолУпак");
ТЗШапка.Колонки.Добавить("ОбщКол");
ТЗШапка.Колонки.Добавить("КолСтрок");
ТЗШапка.Колонки.Добавить("Контрагент");
ТЗШапка.Колонки.Добавить("ТипILNКонтрагента");
ТЗШапка.Колонки.Добавить("ПунктДоставки");
ТЗШапка.Колонки.Добавить("ДатаОтгрузки");
ТЗШапка.Колонки.Добавить("Менеджер");
ТЗШапка.Колонки.Добавить("Организация");
ТЗШапка.Колонки.Добавить("КодДоговора");
//Катаев+ 31/10/13 GLN конечного пункта (для Ленты)
ТЗШапка.Колонки.Добавить("ГЛН_Конечный");
//Катаев- 31/10/13
//Катаев+ 01/12/14 Для Молнии
ТЗШапка.Колонки.Добавить("НомерЗаявкиМолния");
//Катаев- 01/12/14

//нечаева для метро  17,08,16 +++
ТЗШапка.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки

//нечаева для метро 30,10,17 +++
ТЗПечать.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка"));//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  30,10,17 ---




Ашан=0;

// Катаев+ 11/03/13
// Табллицы для Акта
АктШапка = Новый ТаблицаЗначений;
АктШапка.Колонки.Добавить("РНК");
АктШапка.Колонки.Добавить("НомерРНК");
АктШапка.Колонки.Добавить("ДатаРНК");
АктШапка.Колонки.Добавить("Контрагент");
АктШапка.Колонки.Добавить("НомерЗаказа");
АктШапка.Колонки.Добавить("ДатаЗаказа");
АктШапка.Колонки.Добавить("ПунктДоставки");
АктШапка.Колонки.Добавить("ДатаПриемаТовара");
АктШапка.Колонки.Добавить("СостоянияРКМ");
АктШапка.Колонки.Добавить("СостояниеДокумента");
//Катаев+ 20/11/14
АктШапка.Колонки.Добавить("НомерАкта");
//Катаев- 20/11/14

АктТаблица = Новый таблицаЗначений;
АктТаблица.Колонки.Добавить("Номенклатура");
АктТаблица.Колонки.Добавить("ШК");
АктТаблица.Колонки.Добавить("Артикул");
АктТаблица.Колонки.Добавить("Заказано");
АктТаблица.Колонки.Добавить("Отправлено");
АктТаблица.Колонки.Добавить("Принято");
АктТаблица.Колонки.Добавить("Склад");
// Катаев- 11/03/13

// Катаев+ 25/03/13
АктТаблица.Колонки.Добавить("Товар");
// катаев- 25/03/13

//нечаева для метро  17,08,16 +++
АктТаблица.Колонки.Добавить("ТипШК");//блочок или штука, если блочок разворачиваем в штуки
//нечаева для метро  17,08,16 ---



//нечаева 19,03,15+++
ОшибкиАртикул=Новый Массив;
//нечаева 19,03,15---
